app/views/pages/home.html.erb

      <h1>Examples of projects I've worked on:</h1>
      <% Project.all.each do |project| %>
---
SELECT "projects".* FROM "projects"