app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("project_title", "primary_color", "secondary_color_1", "secondary_color_2", "secondary_color_3", "secondary_color_4", "title", "title_short", "sub_title", "description", "section_header_1", "section_text", "section_header_2", "section_text_2", "section_header_3", "section_text_3", "section_header_4", "section_text_4", "section_header_5", "section_text_5", "section_header_6", "section_text_6", "section_header_7", "section_text_7", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "secondary_color_3" = ?, "secondary_color_4" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["secondary_color_3", ""], ["secondary_color_4", ""], ["updated_at", 2016-10-14 13:51:22 UTC], ["id", 1]]